class Area < ActiveHash::Base
    self.data = [
        {id: 0, name: "寮付きのお仕事をご希望されている", param: "寮あり"},
        {id: 1, name: "北海道・東北エリアの", param: "道央,道南,道北,道東,青森,岩手,宮城,秋田,山形,福島"},
        {id: 2, name: "関東エリアの", param: "茨城,栃木,群馬,埼玉,千葉,東京都,神奈川"},
        {id: 3, name: "甲信越・北陸エリアの", param: "新潟,富山,石川,福井,山梨,長野"},
        {id: 4, name: "東海エリアの", param: "岐阜,静岡,愛知,三重"},
        {id: 5, name: "近畿エリアの", param: "滋賀,京都府,大阪府,兵庫,奈良,和歌山"},
        {id: 6, name: "中国・四国エリアの", param: "鳥取,島根,岡山,広島,山口,徳島,香川,愛媛,高知"},
        {id: 7, name: "九州・沖縄エリアの", param: "福岡,佐賀,長崎,熊本,大分,宮崎,鹿児島,沖縄"}
    ]
end